michpro/arduino_libraries/GD32CAN/GD32CAN.h
/**
 * @file        GD32CAN.h
 * @brief       GD32F30x and GD32E50x CAN bus library.
 * Provides a C++ interface for managing CAN peripherals on GD32 microcontrollers.
 *
 * @copyright   SPDX-FileCopyrightText: Copyright 2024-2026 Michal Protasowicki
 * @license     SPDX-License-Identifier: MIT
 */

#pragma once

#include <Arduino.h>

#ifdef __cplusplus
extern "C"
{
#endif
#if defined(GD32F30x)
    #include <gd32f30x_can.h>
    #define HAS_CAN0 1
    #if defined(GD32F30X_CL)
        #define HAS_CAN1 1
    #elif defined(CAN1)
        #undef CAN1
    #else
    #endif
#elif defined(GD32E50X)
    #include <gd32e50x_can.h>
    #define HAS_CAN0 1
    #define HAS_CAN1 1
    #if defined(GD32E50X_CL) || defined(GD32E508)
        #define HAS_CAN2 1
    #else
        #if defined(CAN2)
            #undef CAN2
        #endif
    #endif
#else
    #error "Unsupported mcu!!!"
#endif
#ifdef __cplusplus
}
#endif

/**
 * @namespace CAN
 * @brief Namespace containing all definitions, types, and constants for the CAN library.
 */
namespace CAN
{
    /**
     * @namespace Baudrate
     * @brief Defines supported CAN bus baud rates.
     */
    namespace Baudrate
    {
        /**
         * @enum Baudrate
         * @brief Enumeration of available baud rates in bits per second.
         */
        typedef enum Baudrate : uint32_t
        {
            BD_1M   = 1000000,                                      ///< 1 Mbit/s
            BD_800k = 800000,                                       ///< 800 kbit/s
            BD_750k = 750000,                                       ///< 750 kbit/s
            BD_500k = 500000,                                       ///< 500 kbit/s
            BD_250k = 250000,                                       ///< 250 kbit/s
            BD_200k = 200000,                                       ///< 200 kbit/s
            BD_150k = 150000,                                       ///< 150 kbit/s
            BD_125k = 125000,                                       ///< 125 kbit/s
            BD_100k = 100000,                                       ///< 100 kbit/s
            BD_83k3 = 83333,                                        ///< 83.333 kbit/s
            BD_75k  = 75000,                                        ///< 75 kbit/s
            BD_62k5 = 62500,                                        ///< 62.5 kbit/s
            BD_50k  = 50000,                                        ///< 50 kbit/s
            BD_40k  = 40000,                                        ///< 40 kbit/s
            BD_33k3 = 33333,                                        ///< 33.333 kbit/s
            BD_25k  = 25000,                                        ///< 25 kbit/s
            BD_20k  = 20000,                                        ///< 20 kbit/s
            BD_15k  = 15000,                                        ///< 15 kbit/s
            BD_10k  = 10000,                                        ///< 10 kbit/s
            BD_5k   = 5000,                                         ///< 5 kbit/s
        }baudrate_t;
    }

    /**
     * @namespace WorkingMode
     * @brief Defines the operating modes of the CAN controller.
     */
    namespace WorkingMode
    {
        /**
         * @enum WorkingMode
         * @brief CAN controller working modes.
         */
        typedef enum WorkingMode : uint8_t
        {
            INITIALIZE  = CAN_MODE_INITIALIZE,                      ///< Initialization mode
            NORMAL      = CAN_MODE_NORMAL,                          ///< Normal communication mode
            SLEEP       = CAN_MODE_SLEEP,                           ///< Sleep mode (low power)
        }mode_t;
    }

    /**
     * @namespace Error
     * @brief Defines CAN bus error states and types.
     */
    namespace Error
    {
        static const uint_fast8_t BUS_ERROR_MASK    {0b00011000};
        static const uint_fast8_t DATA_ERROR_MASK   {0b00000111};

        /**
         * @enum Error
         * @brief Enumeration of CAN errors.
         */
        typedef enum Error
        {
            NONE            = CAN_ERROR_NONE,                       ///< No error
            FILL            = CAN_ERROR_FILL,                       ///< Stuff error
            FORMAT          = CAN_ERROR_FORMATE,                    ///< Format error
            ACK_ERR         = CAN_ERROR_ACK,                        ///< Acknowledge error
            BITRECESSIVE    = CAN_ERROR_BITRECESSIVE,               ///< Bit recessive error
            BITDOMINANT     = CAN_ERROR_BITDOMINANTER,              ///< Bit dominant error
            CRC_ERR         = CAN_ERROR_CRC,                        ///< CRC error
            SOFTWARECFG     = CAN_ERROR_SOFTWARECFG,                ///< Software configuration error
            WARNING         = (1 << 3),                             ///< Error warning state
            PASSIVE         = (2 << 3),                             ///< Error passive state
            BUS_OFF         = (3 << 3),                             ///< Bus-off state
        }error_t;
    }

    /**
     * @namespace Device
     * @brief Defines the CAN peripheral instances and pin mappings.
     */
    namespace Device
    {
        /**
         * @enum Device
         * @brief Enumeration of supported CAN device configurations (Instance + Pin Remap).
         */
        typedef enum Device : uint32_t
        {
        #ifdef HAS_CAN0
            CAN_0_DEFAULT   = (uint32_t)CAN0,                       ///< CAN0 on PA11/PA12 (Default)
            CAN_0_ALT1,                                             ///< CAN0 on PB8/PB9 (Remap 1)
            #if defined(PD0)
            CAN_0_ALT2,                                             ///< CAN0 on PD0/PD1 (Remap 2)
            #endif
        #endif
        #ifdef HAS_CAN1
            CAN_1_DEFAULT   = (uint32_t)CAN1,                       ///< CAN1 on PB12/PB13 (Default)
            CAN_1_ALT1,                                             ///< CAN1 on PB5/PB6 (Remap 1)
        #endif
        #ifdef HAS_CAN2
            CAN_2_DEFAULT   = (uint32_t)CAN2,                       ///< CAN2 on PB10/PB11 (Default)
            CAN_2_ALT1,                                             ///< CAN2 on PA9/PA10 (Remap 1)
            #if defined(PE0)
            CAN_2_ALT2,                                             ///< CAN2 on PE0/PE1 (Remap 2)
            #endif
        #endif
        }device_t;
    }

    /**
     * @namespace Frame
     * @brief Defines frame-related constants and types.
     */
    namespace Frame
    {
        static const uint32_t SFID_MASK {0x000007FFU};              ///< Mask for Standard Identifier (11 bits)
        static const uint32_t EFID_MASK {0x1FFFFFFFU};              ///< Mask for Extended Identifier (29 bits)

        /**
         * @namespace Id
         * @brief Identifier types (Standard vs Extended).
         */
        namespace Id
        {
            typedef enum IDType
            {
                STANDARD    = CAN_FF_STANDARD,                      ///< Standard Identifier
                EXTENDED    = CAN_FF_EXTENDED,                      ///< Extended Identifier
            }idType_t;
        }

        /**
         * @namespace Type
         * @brief Frame types (Data vs Remote).
         */
        namespace Type
        {
            typedef enum FrameType
            {
                DATA        = CAN_FT_DATA,                          ///< Data Frame
                RTR         = CAN_FT_REMOTE,                        ///< Remote Transmission Request Frame
            }frameType_t;
        }
    }

    /**
     * @namespace Filter
     * @brief Defines constants and types for CAN hardware filters.
     */
    namespace Filter
    {
        static const uint_fast8_t   MIN_BANK        {0};
        #if defined (GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
        static const uint_fast8_t   MAX_BANK        {27};
        static const uint_fast8_t   MAX_BANK_CAN2   {14};
        #else
        static const uint_fast8_t   MAX_BANK        {13};
        static const uint_fast8_t   MAX_BANK_CAN2   {0};
        #endif

        /**
         * @namespace Bank
         * @brief Filter bank identifiers.
         */
        namespace Bank
        {
            typedef enum Filter : uint_fast8_t
            {
                FLT00 = 0,
                FLT01 = 1,
                FLT02 = 2,
                FLT03 = 3,
                FLT04 = 4,
                FLT05 = 5,
                FLT06 = 6,
                FLT07 = 7,
                FLT08 = 8,
                FLT09 = 9,
                FLT10 = 10,
                FLT11 = 11,
                FLT12 = 12,
                FLT13 = 13,
            #if defined (GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
                FLT14 = 14,
                FLT15 = 15,
                FLT16 = 16,
                FLT17 = 17,
                FLT18 = 18,
                FLT19 = 19,
                FLT20 = 20,
                FLT21 = 21,
                FLT22 = 22,
                FLT23 = 23,
                FLT24 = 24,
                FLT25 = 25,
                FLT26 = 26,
                FLT27 = 27,
            #endif
            }filter_t;
        }

        /**
         * @namespace Mode
         * @brief Filter modes (Mask vs List).
         */
        namespace Mode
        {
            typedef enum Mode
            {
                MASK            = CAN_FILTERMODE_MASK,              ///< Identifier Mask mode
                LIST            = CAN_FILTERMODE_LIST               ///< Identifier List mode
            }mode_t;
        }

        /**
         * @namespace FrameType
         * @brief Filter configuration for frame types.
         */
        namespace FrameType
        {
            typedef enum FilteredFramesType
            {
                DATA        = CAN_FT_DATA,                          ///< Match Data frames only
                RTR         = CAN_FT_REMOTE,                        ///< Match RTR frames only
                ANY,                                                ///< Match both Data and RTR frames
            }filteredFrames_t;
        }

        /**
         * @namespace Id
         * @brief Filter configuration for ID types.
         */
        namespace Id
        {
            typedef enum IDType
            {
                STANDARD    = CAN_FF_STANDARD,                      ///< Match Standard IDs
                EXTENDED    = CAN_FF_EXTENDED,                      ///< Match Extended IDs
                ALL,                                                ///< Match both types
            }idType_t;
        }
    }

    /**
     * @namespace State
     * @brief General Enable/Disable state.
     */
    namespace State
    {
        typedef enum State : uint_fast8_t
        {
            DISABLE = 0,
            ENABLE  = 1,
        }state_t;
    }

    /**
     * @namespace QueueSize
     * @brief Buffer size definitions for RX/TX rings.
     */
    namespace QueueSize
    {
        typedef enum Size : uint_fast16_t
        {
            Q_4     = 4,
            Q_8     = 8,
            Q_16    = 16,
            Q_32    = 32,
            Q_64    = 64,
            Q_128   = 128,
            Q_256   = 256,
            Q_512   = 512,
        }size_t;
    }

    static const uint_fast8_t       MAX_DLC     {8};                ///< Maximum Data Length Code (8 bytes for Classic CAN)

    /**
     * @struct Message
     * @brief Structure representing a CAN message.
     */
    typedef struct Message
    {
        uint32_t    id              {0};                            ///< Message Identifier
        uint8_t     idType          {0};                            ///< ID Type (Standard/Extended)
        uint8_t     frameType       {0};                            ///< Frame Type (Data/RTR)
        uint8_t     dataLen         {0};                            ///< Data Length (0-8)
        uint8_t     data[MAX_DLC]   {0};                            ///< Data payload
    }__attribute__((packed)) message_t;

    /**
     * @struct RingBuffer
     * @brief Circular buffer structure for buffering messages.
     */
    typedef struct RingBuffer
    {
        volatile uint_fast16_t      head;                           ///< Write index
        volatile uint_fast16_t      tail;                           ///< Read index
        uint_fast16_t               size;                           ///< Buffer capacity
        volatile CAN::message_t    *buffer;                         ///< Pointer to message array
    }__attribute__((packed)) ringBuffer_t;
}

/**
 * @class GD32CAN
 * @brief Main class to control GD32 CAN peripheral.
 *
 * This class handles initialization, configuration (baudrate, filters),
 * and transmission/reception of CAN messages using ring buffers and interrupts.
 */
class GD32CAN
{
    public:
        GD32CAN(void) = delete;

        /**
         * @brief Construct a new GD32CAN object.
         * Defaults to 64-message RX queue and 0 TX queue (direct send only).
         * @param device The CAN peripheral device instance to use.
         */
        GD32CAN(CAN::Device::device_t device);

        /**
         * @brief Construct a new GD32CAN object with specified RX queue size.
         * @param device The CAN peripheral device instance.
         * @param rxQueueSize Size of the receive ring buffer.
         */
        GD32CAN(CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize);

        /**
         * @brief Construct a new GD32CAN object with specified RX and TX queue sizes.
         * @param device The CAN peripheral device instance.
         * @param rxQueueSize Size of the receive ring buffer.
         * @param txQueueSize Size of the transmit ring buffer.
         */
        GD32CAN(CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize, CAN::QueueSize::size_t txQueueSize);
        
        /**
         * @brief Destroy the GD32CAN object, freeing resources and disabling interrupts.
         */
        ~GD32CAN(void);

        /**
         * @brief Initializes the CAN peripheral and starts the clock.
         * @param baudrate The desired baud rate.
         * @return true If initialization was successful.
         * @return false If initialization failed.
         */
        bool begin(const CAN::Baudrate::baudrate_t baudrate);

        /**
         * @brief Checks if the library is successfully initialized.
         * @return true if initialized, false otherwise.
         */
        bool isInitialized(void);

        /**
         * @brief Configures a pin to control an external transceiver's sleep mode.
         * @param pin The GPIO pin number connected to the transceiver's silent/sleep pin.
         * @return true on success, false on failure.
         */
        bool attachTransceiverSleepPin(const pin_size_t pin);

        /**
         * @brief Sets the external transceiver mode.
         * @param state ENABLE to wake up (active), DISABLE to sleep.
         * @return true on success, false on failure.
         */
        bool setTransceiverMode(const CAN::State::state_t state);

        /**
         * @brief Sets the internal working mode of the CAN controller.
         * @param mode NORMAL, LOOPBACK, SILENT, or SILENT_LOOPBACK (mapped in enum).
         * @return true on success, false on failure.
         */
        bool setWorkingMode(const CAN::WorkingMode::mode_t mode);

        /**
         * @brief Changes the baud rate of the CAN bus.
         * Calculates time quanta and segments dynamically.
         * @param baudrate The new baud rate.
         * @return true on success, false on failure.
         */
        bool setBaudrate(const CAN::Baudrate::baudrate_t baudrate);

        /**
         * @brief Clears and disables all hardware filters.
         * @return true on success, false on failure.
         */
        bool clearAllFilters(void);

        /**
         * @brief Disables a specific filter bank.
         * @param filterId The filter bank index.
         * @return true on success, false on failure.
         */
        bool disableFilter(const CAN::Filter::Bank::filter_t filterId);

        /**
         * @brief Enables a specific filter bank.
         * @param filterId The filter bank index.
         * @return true on success, false on failure.
         */
        bool enableFilter(const CAN::Filter::Bank::filter_t filterId);

        /**
         * @brief Configures filters to accept all messages of a given ID type.
         * @param idType STANDARD, EXTENDED, or ALL.
         * @return true on success, false on failure.
         */
        bool allowReceiveAllMessages(CAN::Filter::Id::idType_t idType);

