michpro/arduino_libraries/GD32CAN/GD32CAN.h
        // --- Extended Frame Filters ---

        /**
         * @brief Sets a 32-bit Mask mode filter for Extended IDs.
         * @param filterId Filter bank index.
         * @param frameId The ID to match.
         * @param filteredFrames Frame type to match (DATA, RTR, ANY).
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId,
                       const CAN::Filter::FrameType::filteredFrames_t filteredFrames);
        
        /**
         * @brief Sets a 32-bit List mode filter for two specific Extended IDs.
         * @param filterId Filter bank index.
         * @param frameId_1 First ID to match.
         * @param frameType_1 Frame type for first ID.
         * @param frameId_2 Second ID to match.
         * @param frameType_2 Frame type for second ID.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId_1, const CAN::Frame::Type::frameType_t frameType_1,
                                                                   const uint32_t frameId_2, const CAN::Frame::Type::frameType_t frameType_2);
        
        /**
         * @brief Sets a 32-bit Mask mode filter with a custom mask for Extended IDs.
         * @param filterId Filter bank index.
         * @param frameId The ID pattern.
         * @param frameIdMask The mask (1 = bit must match, 0 = don't care).
         * @param filteredFrames Frame type to match.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId,
                       const uint32_t frameIdMask,
                       const CAN::Filter::FrameType::filteredFrames_t filteredFrames);
        
        // --- Standard Frame Filters ---

        /**
         * @brief Sets a 16-bit Mask mode filter for Standard IDs (sets 2 filters essentially).
         * @param filterId Filter bank index.
         * @param frameId The ID to match.
         * @param filteredFrames Frame type to match.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId,
                       const CAN::Filter::FrameType::filteredFrames_t filteredFrames);
        
        /**
         * @brief Sets a 16-bit Mask mode filter for two different Standard IDs.
         * @param filterId Filter bank index.
         * @param frameId_1 First ID.
         * @param filteredFrames_1 Frame type for first ID.
         * @param frameId_2 Second ID.
         * @param filteredFrames_2 Frame type for second ID.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_1,
                                                                   const uint16_t frameId_2, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_2);
        
        /**
         * @brief Sets a 16-bit List mode filter for four specific Standard IDs.
         * @param filterId Filter bank index.
         * @param frameId_1 ID 1.
         * @param frameType_1 Type 1.
         * @param frameId_2 ID 2.
         * @param frameType_2 Type 2.
         * @param frameId_3 ID 3.
         * @param frameType_3 Type 3.
         * @param frameId_4 ID 4.
         * @param frameType_4 Type 4.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const CAN::Frame::Type::frameType_t frameType_1,
                                                                   const uint16_t frameId_2, const CAN::Frame::Type::frameType_t frameType_2,
                                                                   const uint16_t frameId_3, const CAN::Frame::Type::frameType_t frameType_3,
                                                                   const uint16_t frameId_4, const CAN::Frame::Type::frameType_t frameType_4);
        
        /**
         * @brief Sets a 16-bit Mask mode filter with custom mask for Standard IDs.
         * @param filterId Filter bank index.
         * @param frameId ID pattern.
         * @param frameIdMask ID mask.
         * @param filteredFrames Frame type.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId,
                       const uint16_t frameIdMask,
                       const CAN::Filter::FrameType::filteredFrames_t filteredFrames);
        
        /**
         * @brief Sets a 16-bit Mask mode filter with two custom masks for Standard IDs.
         * @param filterId Filter bank index.
         * @param frameId_1 ID 1.
         * @param frameIdMask_1 Mask 1.
         * @param filteredFrames_1 Frame type 1.
         * @param frameId_2 ID 2.
         * @param frameIdMask_2 Mask 2.
         * @param filteredFrames_2 Frame type 2.
         * @return true on success.
         */
        bool setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const uint16_t frameIdMask_1, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_1,
                                                                   const uint16_t frameId_2, const uint16_t frameIdMask_2, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_2);
        
        /**
         * @brief Queues a message for transmission.
         * If TX hardware is busy, adds to ring buffer if available.
         * @param message The message to send.
         * @return true if sent or queued, false if buffer full or error.
         */
        bool write(CAN::message_t &message);

        /**
         * @brief Returns the number of slots available in the TX buffer.
         * @return Number of messages that can be written without blocking/failing.
         */
        uint32_t availableForWrite(void);

        /**
         * @brief Returns the number of messages available in the RX buffer.
         * @return Number of received messages waiting to be read.
         */
        uint32_t available(void);

        /**
         * @brief Peeks at the next message in the RX buffer without removing it.
         * @param message Reference to store the peeked message.
         * @return true if a message was available, false otherwise.
         */
        bool peek(CAN::message_t &message);

        /**
         * @brief Reads and removes the next message from the RX buffer.
         * @param message Reference to store the read message.
         * @return true if a message was read, false if buffer was empty.
         */
        bool read(CAN::message_t &message);

        /**
         * @brief Gets the current error state of the CAN controller.
         * @return Error bitmask (see CAN::Error::error_t).
         */
        uint_fast8_t getError(void);

        #if defined(HAS_CAN1)
        /**
         * @brief Configures the split point between CAN0 and CAN1 filters.
         * @param filterId The first filter bank assigned to CAN1.
         * @return true on success.
         */
        bool setCan1StartFilterId(CAN::Filter::Bank::filter_t filterId);
        #endif

    protected:
        static const uint32_t       CAN_DEVICE_MASK                 {0xFFFFFF00U};
        static const uint32_t       HW_MAX_BAUDRATE                 {1000000U};
        #if defined(GD32E508)
        // BS1[6:0] + BS2[4:0]
        static const uint32_t       CAN_BT_SEG_MAX                  {158U};
        static const uint32_t       CAN_BT_SEG_MIN                  {3U};
        // BS1[3:0] + BS2[2:0]
        static const uint32_t       CAN_FD_BT_SEG_MAX               {22U};
        static const uint32_t       CAN_FD_BT_SEG_MIN               {3U};
        // CAN related register mask
        static const uint32_t       CAN_BS1_MASK                    {0x000F0000U};
        static const uint32_t       CAN_BS2_MASK                    {0x00700000U};
        static const uint32_t       CAN_FD_SJW_MASK                 {0x07000000U};
        #else
        // BS1[3:0] + BS2[2:0]
        static const uint32_t       CAN_BT_SEG_MAX                  {22U};
        static const uint32_t       CAN_BT_SEG_MIN                  {3U};
        #endif
        // CAN related register mask
        static const uint32_t       CAN_BAUDPSC_MASK                {0x000003FFU};
        static const uint32_t       CAN_SJW_MASK                    {0x1F000000U};

