michpro/arduino_libraries/GD32CAN/GD32CAN.h
        static const int_fast8_t    DEFAULT_CAN1_START_FILTER_ID    {14};
        static const uint_fast8_t   INSTANCES_MASK_CAN0             {0x01};
        static const uint_fast8_t   INSTANCES_MASK_CAN1             {0x02};
        static const uint_fast8_t   INSTANCES_MASK_CAN2             {0x04};
        static const pin_size_t     NO_PIN                          {0xFF};

        typedef enum Scale : uint16_t
        {
            FILTERBITS_16   = CAN_FILTERBITS_16BIT,
            FILTERBITS_32   = CAN_FILTERBITS_32BIT,
        }scale_t;

        typedef enum IRQ : uint32_t
        {
            IRQ_RX_FIFO_NE      = CAN_INT_RFNE0,
            IRQ_TX_MAILBOX_E    = CAN_INT_TME,
        }irq_t;

        static uint_fast8_t         instances;
        static int_fast8_t          can1StartFilterId;

        CAN::Device::device_t       _device                         {static_cast<CAN::Device::device_t>(0)};
        uint32_t                    _deviceBase                     {0x00000000U};
        uint_fast8_t                _instance_mask                  {0x00};
        bool                        _isInstanceAllowed              {false};
        bool                        _isInitialized                  {false};
        uint32_t                    _filtersStates                  {0x00000000U};
        int_fast8_t                 _firstFilterId                  {CAN::Filter::MIN_BANK};
        pin_size_t                  _transceiverSleepPin            {NO_PIN};
        volatile CAN::message_t    *_rxBuffer                       {nullptr};
        volatile CAN::ringBuffer_t  _rxRing                         {};
        volatile bool              *_rxIrqEnabled                   {nullptr};
        volatile CAN::message_t    *_txBuffer                       {nullptr};
        volatile CAN::ringBuffer_t  _txRing                         {};

        void init(const CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize, CAN::QueueSize::size_t txQueueSize);
        inline void detachTransceiverSleepPin(void);
        void canDeinit(void);
        bool canConfig(const CAN::Baudrate::baudrate_t baudrate);
        inline uint32_t calculateCANBTRegValue(CAN::Baudrate::baudrate_t baudrate);
        bool calculateCANBTValues(const CAN::Baudrate::baudrate_t baudrate, uint16_t &baudpsc, uint8_t &bs1, uint8_t &bs2, uint8_t &sjw);
        void gpioConfig(const CAN::State::state_t state);
        void nvicConfig(const CAN::State::state_t state);
        bool initCanHw(const CAN::Baudrate::baudrate_t baudrate, CAN::State::state_t autoRetrans);
        void setIrqState(const uint32_t irq, const CAN::State::state_t state);
        int_fast8_t getMaxFilterId(void);
        bool setFilter( const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId,    const uint32_t frameIdMask,
                        const CAN::Filter::Mode::mode_t filterMode, const scale_t filterScale, const CAN::State::state_t state);
        inline bool isFilterAvailable(const CAN::Filter::Bank::filter_t filterId) __attribute__((always_inline));
        bool setFilterState(const CAN::Filter::Bank::filter_t filterId, const CAN::State::state_t state);
};
